---
kind: type
id: T:Autodesk.Revit.DB.ReferencePlane
source: html/e7003ec7-1dbe-50a2-fb3d-a83a5a3b5b9f.htm
---
# Autodesk.Revit.DB.ReferencePlane

Represents a reference plane of Autodesk Revit.

## Syntax (C#)
```csharp
public class ReferencePlane : DatumPlane
```